#+title: PacmanProgressBar in Elixir

Command line progress bar like the one from Arch Linux's pacman package manager.

I got my inspiration from [[https://dennisbeatty.com/cool-clis-in-elixir-with-io-write-2/][Cool CLIs in Elixir with IO.write/2 by Dennis Beatty]], [[https://github.com/henrik/progress_bar][progress_bar by henrik]], my own old project [[https://gitlab.com/Pistrie/pacmanprogressbar][PacmanProgressBar in Java]], and of course the [[https://wiki.archlinux.org/title/pacman][pacman package manager]].

* Table of contents :toc:
  - [[#usage][Usage]]
  - [[#installation][Installation]]
  - [[#license][License]]

** Usage

You can render the progress bar using PacmanProgressBar.render/2. You specify the total amount of tasks being executed and the amount of tasks completed.

#+begin_src elixir
PacmanProgressBar.render(30, 7)
#+end_src

#+RESULTS:
: [------c-o--o--o--o--o--o--o--]  23%

You can also get this progress bar in the form of a string, in case that's something you would need.

#+begin_src elixir
PacmanProgressBar.raw(30, 7)
#+end_src

#+RESULTS:
: "[------c-o--o--o--o--o--o--o--]  23%"

** Installation

If [[https://hex.pm/docs/publish][available in Hex]], the package can be installed by adding `pacman_progress_bar` to your list of dependencies in `mix.exs`:

#+begin_src elixir
def deps do
  [
    {:pacman_progress_bar, "~> 0.0.0"}
  ]
end
#+end_src

Documentation can be generated with [[https://github.com/elixir-lang/ex_doc][ExDoc]] and published on [[https://hexdocs.pm][HexDocs]]. Once published, the docs can be found at <https://hexdocs.pm/pacman_progress_bar>.

** License

Released under the [[https://www.gnu.org/licenses/lgpl-3.0.html][LGPL]].
